nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_common.h
    kStatusGroup_HAL_GPIO = 121,              /*!< Group number for HAL GPIO status codes. */
    kStatusGroup_HAL_UART = 122,              /*!< Group number for HAL UART status codes. */
    kStatusGroup_HAL_TIMER = 123,             /*!< Group number for HAL TIMER status codes. */
    kStatusGroup_HAL_SPI = 124,               /*!< Group number for HAL SPI status codes. */
    kStatusGroup_HAL_I2C = 125,               /*!< Group number for HAL I2C status codes. */
    kStatusGroup_HAL_FLASH = 126,             /*!< Group number for HAL FLASH status codes. */
    kStatusGroup_HAL_PWM = 127,               /*!< Group number for HAL PWM status codes. */
    kStatusGroup_HAL_RNG = 128,               /*!< Group number for HAL RNG status codes. */
    kStatusGroup_TIMERMANAGER = 135,          /*!< Group number for TiMER MANAGER status codes. */
    kStatusGroup_SERIALMANAGER = 136,         /*!< Group number for SERIAL MANAGER status codes. */
    kStatusGroup_LED = 137,                   /*!< Group number for LED status codes. */
    kStatusGroup_BUTTON = 138,                /*!< Group number for BUTTON status codes. */
    kStatusGroup_EXTERN_EEPROM = 139,         /*!< Group number for EXTERN EEPROM status codes. */
    kStatusGroup_SHELL = 140,                 /*!< Group number for SHELL status codes. */
    kStatusGroup_MEM_MANAGER = 141,           /*!< Group number for MEM MANAGER status codes. */
    kStatusGroup_LIST = 142,                  /*!< Group number for List status codes. */
    kStatusGroup_OSA = 143,                   /*!< Group number for OSA status codes. */
    kStatusGroup_COMMON_TASK = 144,           /*!< Group number for Common task status codes. */
    kStatusGroup_MSG = 145,                   /*!< Group number for messaging status codes. */
    kStatusGroup_SDK_OCOTP = 146,             /*!< Group number for OCOTP status codes. */
    kStatusGroup_SDK_FLEXSPINOR = 147,        /*!< Group number for FLEXSPINOR status codes.*/
    kStatusGroup_CODEC = 148,                 /*!< Group number for codec status codes. */
    kStatusGroup_ASRC = 149,                 /*!< Group number for codec status ASRC. */
    kStatusGroup_OTFAD = 150,                 /*!< Group number for codec status codes. */
    kStatusGroup_SDIOSLV = 151,                 /*!< Group number for SDIOSLV status codes. */
    kStatusGroup_QSCI    = 152,
};

/*! @brief Generic status return codes. */
enum
{
    kStatus_Success = MAKE_STATUS(kStatusGroup_Generic, 0),
    kStatus_Fail = MAKE_STATUS(kStatusGroup_Generic, 1),
    kStatus_ReadOnly = MAKE_STATUS(kStatusGroup_Generic, 2),
    kStatus_OutOfRange = MAKE_STATUS(kStatusGroup_Generic, 3),
    kStatus_InvalidArgument = MAKE_STATUS(kStatusGroup_Generic, 4),
    kStatus_Timeout = MAKE_STATUS(kStatusGroup_Generic, 5),
    kStatus_NoTransferInProgress = MAKE_STATUS(kStatusGroup_Generic, 6),
};


/*! @brief Type used for all status and error return values. */
typedef int32_t status_t;

#ifndef bool
typedef uint8_t bool;
#define true  1
#define false 0
#endif

/*! @name Min/max macros */
/* @{ */
#if !defined(MIN)
#define MIN(a, b) (((a) < (b)) ? (a) : (b))
#endif

#if !defined(MAX)
#define MAX(a, b) (((a) > (b)) ? (a) : (b))
#endif
/* @} */

/*! @brief Computes the number of elements in an array. */
#if !defined(ARRAY_SIZE)
#define ARRAY_SIZE(x) (sizeof(x) / sizeof((x)[0]))
#endif

/*! @name UINT16_MAX/UINT32_MAX value */
/* @{ */
#if !defined(UINT16_MAX)
#define UINT16_MAX ((uint16_t)-1)
#endif

#if !defined(UINT32_MAX)
#define UINT32_MAX ((uint32_t)-1)
#endif
/* @} */

/*! @name Timer utilities */
/* @{ */
/*! Macro to convert a microsecond period to raw count value */
#define USEC_TO_COUNT(us, clockFreqInHz) (uint32_t)(((float)clockFreqInHz / 1000000U) * us)
/*! Macro to convert a raw count value to microsecond */
#define COUNT_TO_USEC(count, clockFreqInHz) (uint32_t)(((float)count / clockFreqInHz) * 1000000U)

/*! Macro to convert a millisecond period to raw count value */
#define MSEC_TO_COUNT(ms, clockFreqInHz) (uint32_t)(((float)clockFreqInHz / 1000U) * ms)
/*! Macro to convert a raw count value to millisecond */
#define COUNT_TO_MSEC(count, clockFreqInHz) (uint32_t)(((float)count / clockFreqInHz) * 1000U)
/* @} */

/*! @name Alignment variable definition macros */
/* @{ */
/*! Macro to define a variable with alignbytes alignment */
#define SDK_ALIGN(var, alignbytes) var __attribute__((aligned(alignbytes)))

/*! Macro to change a value to a given size aligned value */
#define SDK_SIZEALIGN(var, alignbytes) \
    ((unsigned int)((var) + ((alignbytes)-1U)) & (unsigned int)(~(unsigned int)((alignbytes)-1U)))

#define AT_NONCACHEABLE_SECTION(var) var
#define AT_NONCACHEABLE_SECTION_ALIGN(var, alignbytes) var __attribute__((aligned(alignbytes)))
#define AT_NONCACHEABLE_SECTION_INIT(var) var
#define AT_NONCACHEABLE_SECTION_ALIGN_INIT(var, alignbytes) var __attribute__((aligned(alignbytes)))

/* @} */

#define INTC_TYPE_REG_INDEX(x)   (((uint8_t)(x))>>3U)
#define INTC_TYPE_BIT_INDEX(x)   ((((uint8_t)(x))&0x7U)<<1U)

/*! @brief Default DSC interrupt priority number. */
#define SDK_DSC_DEFAULT_INT_PRIO 1U

/*! @brief Set base core IRQ priority, that core will response the interrupt request with priority >= base IRQ priority. */
#define SetIRQBasePriority(x)  __EI##x()

/*!
 * @brief Read register value.
 *
 * Example:
 *    val = PeriphReadReg(OCCS->OSCTL2);
 *
 * @param reg Register name.
 *
 * @return The value of register.
 */
#define PeriphReadReg(reg)   (reg)

/*!
 * @brief Write data to register.
 *
 * Example:
 *    PeriphWriteReg(OCCS->OSCTL2, 0x278U);
 *
 * @param reg Register name.
 * @param data Data wrote to register.
 */
#define PeriphWriteReg( reg, data )   (reg) = (data)

/*!
 * @brief Set specified bits in register.
 *
 * Example:
 *    PeriphSetBits(OCCS->OSCTL2, 0x12U);
 *
 * @param reg Register name.
 * @param bitMask Bits mask, set bits will be set in the register.
 */
#define PeriphSetBits( reg, bitMask )   (reg) |= (bitMask)

/*!
 * @brief Clear specified bits in register.
 *
 * Example:
 *    PeriphClearBits(OCCS->OSCTL2, 0x12U);
 *
 * @param reg Register name.
 * @param bitMask Bits mask, set bits will be cleared in the register.
 */
#define PeriphClearBits( reg, bitMask )   (reg) &= (~(bitMask))

/*!
 * @brief Invert specified bits in register.
 *
 * Example:
 *    PeriphInvertBits(OCCS->OSCTL2, 0x12U);
 *
 * @param reg Register name.
 * @param bitMask Bits mask, set bits will be inverted in the register.
 */
#define PeriphInvertBits( reg, bitMask )   (reg) ^= (bitMask)

/*!
 * @brief Get specified bits in register.   .
 *
 * Example:
 *    val = PeriphGetBits(OCCS->OSCTL2, 0x23U);
 *
 * @param reg Register name.
 * @param bitMask Bits mask, specify the getting bits.
 *
 * @return The value of specified bits.
 */
#define PeriphGetBits( reg, bitMask )   ( (reg) & (bitMask) )

/*!
 * @brief Write group of bits to register.
 *
 * Example:
 *    PeriphWriteBitGroup(OCCS->DIVBY, OCCS_DIVBY_COD_MASK, OCCS_DIVBY_COD(23U));
 *    PeriphWriteBitGroup(OCCS->DIVBY, OCCS_DIVBY_COD_MASK | OCCS_DIVBY_PLLDB_MASK, \
 *        OCCS_DIVBY_COD(23U) | OCCS_DIVBY_PLLDB(49U));
 *
 * @param reg Register name.
 * @param bitMask Bits mask, mask of the group of bits.
 * @param bitValue This value will be written into the bit group specified by parameter bitMask.
 */
#define PeriphWriteBitGroup( reg, bitMask, bitValue )  (reg) = ((reg) & ~(bitMask)) | ((bitValue) & (bitMask))

/*!
 * @brief Clear (acknowledge) flags which are active-high and are cleared-by-write-one.
 *
 * This macro is useful when a register is comprised by normal read-write bits and cleared-by-write-one bits.
 * Example:
 *    PeriphSafeClearFlags(PWMA->FAULT[0].FSTS, PWM_FSTS_FFLAG_MASK, PWM_FSTS_FFLAG(2));
 *
 * @param reg Register name.
 * @param allFlagsMask Mask for all flags which are active-high and are cleared-by-write-one.
 * @param flagMask The selected flags(cleared-by-write-one) which are supposed to be cleared.
 */
#define PeriphSafeClearFlags( reg, allFlagsMask, flagMask )   (reg) = ((reg) & (~(allFlagsMask))) | ((flagMask) & (allFlagsMask))

/*!
 * @brief  Clear selected bits without modifying (acknowledge) bit flags which are active-high and are cleared-by-write-one.
 *
 * This macro is useful when a register is comprised by normal read-write bits and cleared-by-write-one bits.
 * Example:
 *    PeriphSafeClearBits(PWMA->FAULT[0].FSTS, PWM_FSTS_FFLAG_MASK, PWM_FSTS_FHALF(2));
 *
 * @param reg Register name.
 * @param allFlagsMask Mask for all flags which are active-high and are cleared-by-write-one.
 * @param bitMask The selected bits which are supposed to be cleared.
 */
#define PeriphSafeClearBits( reg, allFlagsMask, bitMask )   (reg) = ((reg) & (~((allFlagsMask) | (bitMask))))


/*!
 * @brief  Set selected bits without modifying (acknowledge) bit flags which are active-high and are cleared-by-write-one.
 *
 * This macro is useful when a register is comprised by normal read-write bits and cleared-by-write-one bits.
 * Example:
 *    PeriphSafeSetBits(PWMA->FAULT[0].FSTS, PWM_FSTS_FFLAG_MASK, PWM_FSTS_FHALF(2));
 *
 * @param reg Register name.
 * @param allFlagsMask Mask for all flags which are active-high and are cleared-by-write-one.
 * @param bitMask The selected bits which are supposed to be set.
 */
#define PeriphSafeSetBits( reg, allFlagsMask, bitMask )   (reg) = ((reg) & (~(allFlagsMask))) | ((bitMask) & (~(allFlagsMask)))

/*!
 * @brief  Write group of bits without modifying (acknowledge) bit flags which are active-high and are cleared-by-write-one.
 *
 * This macro is useful when a register is comprised by normal read-write bits and cleared-by-write-one bits.
 * Example:
 *    PeriphSafeWriteBitGroup(PWMA->FAULT[0].FSTS, PWM_FSTS_FFLAG_MASK, PWM_FSTS_FHALF_MASK, PWM_FSTS_FHALF(3U));
 *    PeriphSafeWriteBitGroup(PWMA->FAULT[0].FSTS, PWM_FSTS_FFLAG_MASK, PWM_FSTS_FHALF_MASK | PWM_FSTS_FFULL_MASK, \
 *        PWM_FSTS_FHALF(3U) | PWM_FSTS_FFULL(2U));
 *
 * @param reg Register name.
 * @param allFlagsMask Mask for all flags which are active-high and are cleared-by-write-one.
 * @param bitMask Bits mask, mask of the group of bits.
 * @param bitValue This value will be written into the bit group specified by parameter bitMask.
 */
#define PeriphSafeWriteBitGroup( reg, allFlagsMask, bitMask, bitValue )  \
	(reg) = ((reg) & (~((allFlagsMask)|(bitMask)))) | ((bitValue) & (bitMask) & (~(allFlagsMask)))

