nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_common.h
/*
 * The fsl_clock.h is included here because it needs MAKE_VERSION/MAKE_STATUS/status_t
 * defined in previous of this file.
 */
#include "fsl_clock.h"
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C"
{
#endif

/*!
 * @name Interrupt
 *
 * DSC interrupt controller uses the same bit-filed to control interrupt enable
 * status and priority, to provide compatible APIs, SDK uses a interrupt priority
 * table, thus application could control the interrupt
 * enable/disable, and interrupt priority independently. Also, the API
 * @ref EnableIRQWithPriority could be used to enable the interrupt and set the priority
 * at the same time.
 *
 * API implementation:
 *
 * 1. When calling @ref EnableIRQ, if the interrupt priority in priority table is
 * valid, then set the interrupt priority level to the value in priority table
 * If interrupt priority in priority table is invalid, then set the interrupt
 * priority level to @ref SDK_DSC_DEFAULT_INT_PRIO.
 *
 * 2. When calling @ref IRQ_SetPriority, if the interrupt is already enabled, new
 * priority is set to interrupt controller, meanwhile the priority table is
 * updated accordingly. If the interrupt is not enabled, new priority value is
 * saved to priority table , and takes effect when calling @ref EnableIRQ.
 *
 * The interrupt functions configure INTC module, application could call the
 * INTC driver directly for the same purpose.
 *
 * @{
 */

/*!
 * @brief Enable the IRQ, and also set the interrupt priority.
 *
 * @note The parameter @p priNum is range in 1~3, and its value is **NOT**
 * directly map to interrupt priority.
 *
 * - Some IPs maps 1 to priority 1, 2 to priority 2, 3 to priority 3
 * - Some IPs maps 1 to priority 0, 2 to priority 1, 3 to priority 2
 *
 * User should check chip's RM to get its corresponding interrupt priority.
 *
 * When @p priNum set as 0, then @ref SDK_DSC_DEFAULT_INT_PRIO is set instead.
 * When @p priNum set as number larger than 3, then only the 2 LSB take effect,
 * for example, setting @p priNum to 5 is the same with setting it to 1.
 *
 * This function configures INTC module, application could call the
 * INTC driver directly for the same purpose.
 *
 * @param irq The IRQ to enable.
 * @param priNum Priority number set to interrupt controller register.
 * Larger number means higher priority.
 * The allowed range is 1~3, and its value is **NOT** directly map to interrupt priority.
 * In other words, the same priority number means different interrupt priority levels
 * for different IRQ, please check reference manual for the relationship.
 * When pass in 0, then @ref SDK_DSC_DEFAULT_INT_PRIO is set to priority register.
 *
 * @return Currently only returns kStatus_Success, will enhance in the future.
 */
status_t EnableIRQWithPriority(IRQn_Type irq, uint8_t priNum);

/*!
 * @brief Disable specific interrupt.
 *
 * This function configures INTC module, application could call the
 * INTC driver directly for the same purpose.
 *
 * @param irq The IRQ to disable.
 *
 * @return Currently only returns kStatus_Success, will enhance in the future.
 */
status_t DisableIRQ(IRQn_Type irq);

/*!
 * @brief Enable specific interrupt.
 *
 * The recommended workflow is calling @ref IRQ_SetPriority first, then call
 * @ref EnableIRQ. If @ref IRQ_SetPriority is not called first, then the interrupt
 * is enabled with default priority value @ref SDK_DSC_DEFAULT_INT_PRIO.
 *
 * Another recommended workflow is calling @ref EnableIRQWithPriority directly,
 * it is the same with calling @ref IRQ_SetPriority + @ref EnableIRQ.
 *
 * This function configures INTC module, application could call the
 * INTC driver directly for the same purpose.
 *
 * @param irq The IRQ to enable.
 *
 * @return Currently only returns kStatus_Success, will enhance in the future.
 */
status_t EnableIRQ(IRQn_Type irq);

/*!
 * @brief Set the IRQ priority.
 *
 * @note The parameter @p priNum is range in 1~3, and its value is **NOT**
 * directly map to interrupt priority.
 *
 * - Some IPs maps 1 to priority 1, 2 to priority 2, 3 to priority 3
 * - Some IPs maps 1 to priority 0, 2 to priority 1, 3 to priority 2
 *
 * User should check chip's RM to get its corresponding interrupt priority
 *
 * When @p priNum set as 0, then @ref SDK_DSC_DEFAULT_INT_PRIO is set instead.
 * When @p priNum set as number larger than 3, then only the 2 LSB take effect,
 * for example, setting @p priNum to 5 is the same with setting it to 1.
 *
 * This function configures INTC module, application could call the
 * INTC driver directly for the same purpose.
 *
 * @param irq The IRQ to set.
 * @param priNum Priority number set to interrupt controller register.
 * Larger number means higher priority, 0 means disable the interrupt.
 * The allowed range is 0~3, and its value is **NOT** directly map to interrupt priority.
 * In other words, the same priority number means different interrupt priority levels
 * for different IRQ, please check reference manual for the relationship.
 *
 * @return Currently only returns kStatus_Success, will enhance in the future.
 */
status_t IRQ_SetPriority(IRQn_Type irq, uint8_t priNum);

/*!
 * @brief Disable the global IRQ
 */
static inline uint32_t DisableGlobalIRQ(void)
{
    uint32_t ret;
    if( (INTC->CTRL & INTC_CTRL_INT_DIS_MASK) != 0U )
    {
        ret = 0U;
    }
    else
    {
        INTC->CTRL |= INTC_CTRL_INT_DIS_MASK;
        ret= 1U;
    }
    return ret;
}

/*!
 * @brief Enable the global IRQ
 */
static inline void EnableGlobalIRQ(uint32_t irqSts)
{
    if(irqSts != 0U)
    {
        INTC->CTRL &= ~INTC_CTRL_INT_DIS_MASK;
    }
    else
    {
        INTC->CTRL |= INTC_CTRL_INT_DIS_MASK;
    }
}

/*!
 * @brief Check if currently core is able to response IRQ
 */
static inline bool isIRQAllowed(void)
{
    bool ret = true;
    uint16_t srReg;

    if(0 != (INTC->CTRL | INTC_CTRL_INT_DIS_MASK))
    {
        ret = false;
    }

    asm {move.w SR, srReg};
    if (0 != (srReg & 0x300U))
    {
        ret = false;
    }
    return ret;
}

/* @} */

/*!
 * @brief Allocate memory with given alignment and aligned size.
 *
 * This is provided to support the dynamically allocated memory
 * used in cache-able region.
 * @param size The length required to malloc.
 * @param alignbytes The alignment size.
 * @retval The allocated memory.
 */
void *SDK_Malloc(size_t size, size_t alignbytes);

/*!
 * @brief Free memory.
 *
 * @param ptr The memory to be release.
 */
void SDK_Free(void *ptr);

/*!
* @brief Delay core cycles.
*  Please note that, this API uses software loop for delay, the actual delayed
*  time depends on core clock frequency, where the function is located (ram or flash),
*  flash clock, possible interrupt.
*
* @param u32Num  Number of core clock cycle which needs to be delayed.
*/
void SDK_DelayCoreCycles(uint32_t u32Num);

/*!
* @brief Delay at least for some time.
*  Please note that, this API uses while loop for delay, different run-time environments make the time not precise,
*  if precise delay count was needed, please implement a new delay function with hardware timer.
*
* @param delay_us  Delay time in unit of microsecond.
* @param coreClock_Hz  Core clock frequency with Hz.
*/
void SDK_DelayAtLeastUs(uint32_t delay_us, uint32_t coreClock_Hz);

#if defined(__cplusplus)
}
#endif

#endif  /* ( (!defined(__DSC__)) || (!defined(__CW__)) ) */

/* @} */

#endif /* _FSL_COMMON_H_ */
